---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.RailingSystemFamilyTopRail
source: html/fd1d56b8-6d89-b118-a7d5-d1e7f26a6bd9.htm
---
# Autodesk.Revit.DB.GroupTypeId.RailingSystemFamilyTopRail Property

Top Rail.

## Syntax (C#)
```csharp
public static ForgeTypeId RailingSystemFamilyTopRail { get; }
```